# Data input and output
- CSV
- Excel
- HTML
- SQL

In [1]:
import pandas as pd

In [2]:
pd.read_csv('example.csv')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [25]:
# json example

In [6]:
pd.read_json('users.json')

,_id,name,email,role,password
0,5d7a514b5d2c12c7449be042,Admin Account,admin@gmail.com,admin,123456
1,5d7a514b5d2c12c7449be043,Publisher Account,publisher@gmail.com,publisher,123456
2,5d7a514b5d2c12c7449be044,User Account,user@gmail.com,user,123456

In [24]:
# csv example

In [5]:
df = pd.read_csv('./example.csv')

In [9]:
df.shape

(4, 4)

In [10]:
df.to_csv('My-output', index=False)

In [12]:
pd.read_csv('My-output')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [22]:
# Excel

In [23]:
 pd.read_excel('Excel_Sample.xlsx', sheet_name='Sheet1')

XLRDError: No sheet named <'Sheet1'>

In [ ]:
df.to_excel('Excel_Sample.xlsx', sheet_name='NewSheet')

In [26]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [27]:
# HTML

In [28]:
data = pd.read_html('https://www.fdic.gov/bank/individual/failed/banklist.html')

In [29]:
data[0]

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
1,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
2,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
3,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019"
4,The Enloe State Bank,Cooper,TX,10716,"Legend Bank, N. A.","May 31, 2019"
...,...,...,...,...,...,...
555,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001"
556,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001"
557,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001"
558,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000"
559,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000"

In [31]:
data[0].head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
1,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
2,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
3,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019"
4,The Enloe State Bank,Cooper,TX,10716,"Legend Bank, N. A.","May 31, 2019"

In [32]:
# SQL

In [33]:
from sqlalchemy import create_engine

In [34]:
engine = create_engine('sqlite:///:memory:')

In [35]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [36]:
df.to_sql('my_table', engine)

In [37]:
sqldf = pd.read_sql('my_table', con=engine)

In [38]:
sqldf

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15

In [4]:
df.head

NameError: name 'df' is not defined